## Упражнение 2 Дан кортеж tpl.
# Напишите код, который выведет на экран последний элемент кортежа tpl.
# Sample input: tpl = (1, 2, 3, 4)
# Sample output: 4

tpl = (1, 2, 3, 4)
element = tpl[-1]
print(element)